{
    "id": "D.MDI.2038",
    "name": "Security principal reconnaissance (LDAP)",
    "system": "Microsoft Defender for Identity",
    "type": "Defense Technique",
    "intid": 2038,
    "filename": "Security-principal-reconnaissance(LDAP).json",
    "description": "Security principal reconnaissance is used by attackers to gain critical information about the domain environment. Information that helps attackers map the domain structure, as well as identify privileged accounts for use in later steps in their attack kill chain. Lightweight Directory Access Protocol (LDAP) is one the most popular methods used for both legitimate and malicious purposes to query Active Directory. LDAP focused security principal reconnaissance is commonly used as the first phase of a Kerberoasting attack. Kerberoasting attacks are used to get a target list of Security Principal Names (SPNs), which attackers then attempt to get Ticket Granting Server (TGS) tickets for. To allow Defender for Identity to accurately profile and learn legitimate users, no alerts of this type are triggered in the first 10 days following Defender for Identity deployment. Once the Defender for Identity initial learning phase is completed, alerts are generated on computers that perform suspicious LDAP enumeration queries or queries targeted to sensitive groups that using methods not previously observed.",
    "created": "2022-05-01",
    "severity": "medium",
    "fpratio": 0.3,
    "tags": [
        "Discovery",
        "Credential Access"
    ],
    "references": [
        "http://researchpapers.com/art/2022/03/research-on-keylogging.html"
    ],
    "detects": {
        "T1087.002": {
            "accuracy": "medium"
        }
    },
    "uses": [
        "Network Traffic: Network Traffic Content",
        "Active Directory: Active Directory Object Access"
    ],
    "scope": {
        "countries": [
            "Poland",
            "Germany",
            "China"
        ],
        "clients": [
            "Client-A",
            "Client-D"
        ],
        "systems": [
            "windows",
            "linux"
        ]
    }
}