{
    "id": "D.MDI.2009",
    "name": "Suspected Golden Ticket usage (encryption downgrade)",
    "system": "Microsoft Defender for Identity",
    "type": "Defense Technique",
    "intid": 2009,
    "filename": "Suspected-Golden-Ticket-usage-(encryption-downgrade).json",
    "description": "Encryption downgrade is a method of weakening Kerberos by downgrading the encryption level of different protocol fields that normally have the highest level of encryption. A weakened encrypted field can be an easier target to offline brute force attempts. Various attack methods utilize weak Kerberos encryption cyphers. In this detection, Defender for Identity learns the Kerberos encryption types used by computers and users, and alerts you when a weaker cypher is used that is unusual for the source computer and/or user and matches known attack techniques. In a Golden Ticket alert, the encryption method of the TGT field of TGS_REQ (service request) message from the source computer was detected as downgraded compared to the previously learned behavior. This is not based on a time anomaly (as in the other Golden Ticket detection). In addition, in the case of this alert, there was no Kerberos authentication request associated with the previous service request, detected by Defender for Identity.",
    "created": "2022-05-01",
    "severity": "high",
    "fpratio": 0.1,
    "tags": [
        "Persistence",
        "Priviledge Escalation",
        "Lateral Movement"
    ],
    "references": [
        "http://researchpapers.com/art/2022/03/research-on-keylogging.html"
    ],
    "detects": {
        "T1558.001": {
            "accuracy": "high"
        }
    },
    "uses": [
        "Network Traffic: Network Traffic Content"
    ],
    "scope": {
        "countries": [
            "Poland",
            "Germany",
            "China"
        ],
        "clients": [
            "Client-A",
            "Client-D"
        ],
        "systems": [
            "windows",
            "linux"
        ]
    }
}